{
  "locale": "de",
  "translations": {
    "2063278710266911963": "Willkommen auf einer Quizseite zum Lernen von JavaScript, TypeScript und Angular",
    "2821179408673282599": "Home",
    "7678383954334189675": "Wissenwertes",
    "457639404001471952": "Quiz Auswahl",
    "397497450705980813": "Kontakt",
    "6517955862074401309": " Hier gehts weiter. Klick auf den Button! ",
    "3499489244415813668": "Dann taucht ein Quiz auf. Bist du bereit? ",
    "4616646812923126199": "Entdecke die Welt von JavaScript, TypeScript und Angular",
    "7944374462690064846": "JavaScript ist eine hochdynamische Skriptsprache, die in erster Linie für das Web entwickelt wurde. Sie ermöglicht die Interaktivität von Webseiten und steuert deren Verhalten.",
    "7357292001964176366": "TypeScript ist eine von Microsoft entwickelte Sprache, die auf JavaScript aufbaut. Sie bietet statische Typisierung und weitere Features, die die Entwicklung komplexer Anwendungen erleichtern.",
    "7948134248733171776": "Angular, ein Open-Source-Framework von Google, ermöglicht die Entwicklung von Single-Page-Anwendungen und Progressive Web Apps mit HTML, CSS und TypeScript.",
    "3975706809650764344": "Angular bietet eine umfangreiche Sammlung von Werkzeugen und Bibliotheken zur Entwicklung, Strukturierung und Testung von Webanwendungen.",
    "7543972251456669562": "Ein zentrales Konzept in Angular sind Komponenten, die wiederverwendbare, isolierte Bausteine darstellen, um das UI-Design und die Funktionalität zu kapseln.",
    "5254626804167751830": "Angular ermöglicht Datenbindung zwischen der Ansichtsschicht (HTML) und der Modellschicht (JavaScript/TypeScript), um eine reaktive Benutzeroberfläche zu schaffen.",
    "2672361839177532065": "Dependency Injection in Angular erleichtert die Verwaltung von Abhängigkeiten zwischen den Komponenten und verbessert die Testbarkeit und Wartbarkeit des Codes.",
    "5357263600632882864": "Das Routing in Angular organisiert verschiedene Ansichten in Single-Page-Anwendungen, was die Benutzererfahrung verbessert, ohne die Seite neu zu laden.",
    "757044598461853389": "Angular bietet auch serverseitiges Rendern von Webanwendungen, was die Leistung und die Suchmaschinenoptimierung verbessern kann.",
    "4417468339535237074": "TypeScript ermöglicht die Nutzung moderner JavaScript-Funktionen wie Klassen, Module und Arrow-Funktionen und verbessert gleichzeitig die Code-Qualität durch frühzeitige Erkennung von Typfehlern."
  }
}