{
  "locale": "de",
  "translations": {
      "2063278710266911963": "Welcome to a quiz site for learning JavaScript, TypeScript, and Angular",
      "2821179408673282599": "Home",
      "7678383954334189675": "Trivia",
      "457639404001471952": "Quiz Selection",
      "397497450705980813": "Contact",
      "6517955862074401309": " Click here to proceed. Click on the button! ",
      "3499489244415813668": "Then a quiz appears. Are you ready? ",
      "4616646812923126199": "Discover the world of JavaScript, TypeScript, and Angular",
      "7944374462690064846": "JavaScript is a highly dynamic scripting language primarily developed for the web. It enables interactivity of web pages and controls their behavior.",
      "7357292001964176366": "TypeScript is a language developed by Microsoft that builds on JavaScript. It offers static typing and additional features that facilitate the development of complex applications.",
      "7948134248733171776": "Angular, an open-source framework by Google, enables the development of single-page applications and progressive web apps with HTML, CSS, and TypeScript.",
      "3975706809650764344": "Angular provides a comprehensive collection of tools and libraries for the development, structuring, and testing of web applications.",
      "7543972251456669562": "A central concept in Angular is components, which represent reusable, isolated building blocks to encapsulate UI design and functionality.",
      "5254626804167751830": "Angular enables data binding between the view layer (HTML) and the model layer (JavaScript/TypeScript) to create a reactive user interface.",
      "2672361839177532065": "Dependency Injection in Angular facilitates the management of dependencies between components and improves the testability and maintainability of the code.",
      "5357263600632882864": "Routing in Angular organizes different views in single-page applications, enhancing user experience without reloading the page.",
      "757044598461853389": "Angular also offers server-side rendering of web applications, improving performance and search engine optimization.",
      "4417468339535237074": "TypeScript enables the use of modern JavaScript features like classes, modules, and arrow functions, while simultaneously improving code quality through early detection of type errors."
    }
  }
  